session-service/load_test_results.txt

# Summary:
#   Total:        0.4801 secs
#   Slowest:      0.0335 secs
#   Fastest:      0.0003 secs
#   Average:      0.0023 secs
#   Requests/sec: 20827.2967
  
#   Total data:   890078 bytes
#   Size/request: 89 bytes

# Response time histogram:
#   0.000 [1]     |
#   0.004 [8923]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#   0.007 [919]   |■■■■
#   0.010 [74]    |
#   0.014 [34]    |
#   0.017 [22]    |
#   0.020 [9]     |
#   0.024 [8]     |
#   0.027 [4]     |
#   0.030 [5]     |
#   0.034 [1]     |


# Latency distribution:
#   10% in 0.0011 secs
#   25% in 0.0014 secs
#   50% in 0.0019 secs
#   75% in 0.0026 secs
#   90% in 0.0037 secs
#   95% in 0.0046 secs
#   99% in 0.0088 secs

# Details (average, fastest, slowest):
#   DNS+dialup:   0.0000 secs, 0.0003 secs, 0.0335 secs
#   DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0012 secs
#   req write:    0.0000 secs, 0.0000 secs, 0.0014 secs
#   resp wait:    0.0023 secs, 0.0002 secs, 0.0330 secs
#   resp read:    0.0000 secs, 0.0000 secs, 0.0011 secs

# Status code distribution:
#   [200] 1 responses
#   [500] 9999 responses